public/lektion1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lektion 1 - Nätverksmodeller</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lektion 1 - Nätverksmodeller</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7c6027b">Kursstruktur</a></li>
<li><a href="#org09285cd">Lektion 1</a></li>
<li><a href="#org5a8a8a4">Exempel på olika</a>
<ul>
<li><a href="#org070d4b5">I/O bus</a></li>
<li><a href="#org081efbb">Serial/parallel ports</a></li>
<li><a href="#org10e9810">Personal Area Networks (PAN)</a></li>
<li><a href="#orgf011641">Local Area Networks (LAN)</a></li>
<li><a href="#org4844629">Metropolitan Area Networks (MAN) (Stadsnät)</a></li>
<li><a href="#org908d3aa">Wide Area Netwroks (WAN)</a></li>
</ul>
</li>
<li><a href="#org5aca88e">Punnkt-till-punkt-förbindelser</a>
<ul>
<li><a href="#orgdea97a7">Källkodning</a></li>
<li><a href="#org7ae3300">Felhantering</a></li>
<li><a href="#org951e4b8">Flödesstyrning</a></li>
<li><a href="#orgeeb64a7">Modulation</a></li>
</ul>
</li>
<li><a href="#org6413ad9">OSI-modellen</a></li>
<li><a href="#org2fa5c3f">TCP/IP - Internetprotokollet</a>
<ul>
<li><a href="#org56f8939">Applikationslagret</a></li>
<li><a href="#org7832ec2">Transport</a></li>
<li><a href="#org3d3864e">Nätverk</a></li>
<li><a href="#org38e4959">Data-länk</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7c6027b" class="outline-2">
<h2 id="org7c6027b"><a href="./index.html">Kursstruktur</a></h2>
</div>
<div id="outline-container-org09285cd" class="outline-2">
<h2 id="org09285cd"><a href="./lektion1.html">Lektion 1</a></h2>
</div>

<div id="outline-container-org5a8a8a4" class="outline-2">
<h2 id="org5a8a8a4">Exempel på olika</h2>
<div class="outline-text-2" id="text-org5a8a8a4">
</div>
<div id="outline-container-org070d4b5" class="outline-3">
<h3 id="org070d4b5">I/O bus</h3>
<div class="outline-text-3" id="text-org070d4b5">
<p>
För användning på till exempel kretskort
</p>
</div>
</div>
<div id="outline-container-org081efbb" class="outline-3">
<h3 id="org081efbb">Serial/parallel ports</h3>
</div>
<div id="outline-container-org10e9810" class="outline-3">
<h3 id="org10e9810">Personal Area Networks (PAN)</h3>
<div class="outline-text-3" id="text-org10e9810">
<p>
Exempel:
</p>
<ul class="org-ul">
<li>Bluetooth</li>
<li>IEEE 802.15 WPAN</li>
<li>RS232("com port")</li>
<li>USB</li>
<li>Firewire</li>
</ul>
</div>
</div>
<div id="outline-container-orgf011641" class="outline-3">
<h3 id="orgf011641">Local Area Networks (LAN)</h3>
<div class="outline-text-3" id="text-orgf011641">
<p>
Exempel:
</p>
<ul class="org-ul">
<li>Ethernet</li>
<li>IEEE 802.11 WLAN</li>
</ul>
</div>
</div>
<div id="outline-container-org4844629" class="outline-3">
<h3 id="org4844629">Metropolitan Area Networks (MAN) (Stadsnät)</h3>
<div class="outline-text-3" id="text-org4844629">
<p>
Example:
</p>
<ul class="org-ul">
<li>Ethernet</li>
<li>ATM</li>
<li>FDDI</li>
</ul>
</div>
</div>
<div id="outline-container-org908d3aa" class="outline-3">
<h3 id="org908d3aa">Wide Area Netwroks (WAN)</h3>
<div class="outline-text-3" id="text-org908d3aa">
<p>
Exampe:
</p>
<ul class="org-ul">
<li>The internet <i>(Debable)</i></li>
<li>The Public Service Telephone Network (PSTN)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5aca88e" class="outline-2">
<h2 id="org5aca88e">Punnkt-till-punkt-förbindelser</h2>
<div class="outline-text-2" id="text-org5aca88e">
</div>
<div id="outline-container-orgdea97a7" class="outline-3">
<h3 id="orgdea97a7">Källkodning</h3>
<div class="outline-text-3" id="text-orgdea97a7">
<p>
Representera data på annat sätt, (digitalisera), samt komprimera
kan vara förstörande (JPEG) eller ej (zip)
</p>
</div>
</div>
<div id="outline-container-org7ae3300" class="outline-3">
<h3 id="org7ae3300">Felhantering</h3>
<div class="outline-text-3" id="text-org7ae3300">
<p>
Lägger till felrättande eller felupptäckande kod.
</p>

<p>
<b>Felrättande</b>: Som kan försöka gissa vad som skulle vara där om det blir fel
<b>Felupptäckande</b>: Som kan upptäcka om det blivit fel
</p>

<p>
Mottagaren kan skicka NACK, Negative acknowledgedment, som gör att sändaren skickar igen.
Om det blir rätt så får man tillbaka ACK.
</p>
</div>
</div>
<div id="outline-container-org951e4b8" class="outline-3">
<h3 id="org951e4b8">Flödesstyrning</h3>
<div class="outline-text-3" id="text-org951e4b8">
<p>
Exempel kan mottagaren vänta med att skicka ACK tillbaka om det går för snabbt
</p>
</div>
</div>
<div id="outline-container-orgeeb64a7" class="outline-3">
<h3 id="orgeeb64a7">Modulation</h3>
<div class="outline-text-3" id="text-orgeeb64a7">
<p>
Modem, gör om till elektrisk representation. Oftast implementerad med \( \sin x \) vågor.
</p>
</div>
</div>
</div>

<div id="outline-container-org6413ad9" class="outline-2">
<h2 id="org6413ad9">OSI-modellen</h2>
<div class="outline-text-2" id="text-org6413ad9">
<ol class="org-ol">
<li>Applikation - Ge tillgång till nätverksresurser</li>
<li>Presentation (<i>inte i internet</i>) - Komprimera, enkryptera och översätta data.</li>
<li>Session (<i>inte i internet)</i> -  Att skapa, underhålla och stänga sessioner.</li>
<li>Transport - Skapa pålitlig end-to-end system för meddelanden och error</li>
<li>Nätverk - Skapar procedurer för att överföra packets från en nod till en på ett annat nätverk.</li>
<li>Data länk -</li>
<li>Fysisk -</li>
</ol>
</div>
</div>

<div id="outline-container-org2fa5c3f" class="outline-2">
<h2 id="org2fa5c3f">TCP/IP - Internetprotokollet</h2>
<div class="outline-text-2" id="text-org2fa5c3f">
</div>
<div id="outline-container-org56f8939" class="outline-3">
<h3 id="org56f8939">Applikationslagret</h3>
<div class="outline-text-3" id="text-org56f8939">
<p>
Lagret där applikationer skapar användardata och kommunicerar med andra applikationer.
Kommunikationspartners utgörs ofta av olika protokoll såsom client-server eller peer-to-peer.
Processer läggs till i form av ports.
Det är här alla kända protokoll implementeras (HTTP, SSH, FTP, SMTP).
</p>
</div>
</div>
<div id="outline-container-org7832ec2" class="outline-3">
<h3 id="org7832ec2">Transport</h3>
<div class="outline-text-3" id="text-org7832ec2">
<p>
Utför host-to-host kommunikation. Den skapar en kanal för överföringen.
UDP (User Datagram Protocol) överför utan felkoll. TCP (Transmission Control Protocol) gör
datan pålitlig och errorhanterad men är desvärre lite långsammare
</p>
</div>
</div>
<div id="outline-container-org3d3864e" class="outline-3">
<h3 id="org3d3864e">Nätverk</h3>
<div class="outline-text-3" id="text-org3d3864e">
<p>
Internetlagret som ger en abstraherad vy av de underliggande nätverkskopplingarna. Det
 vanligaste protokollet är Internet-protokollet som definierar IP-adresser. Dess funktion är
 att transportera data vidare till en annan host som har närmre koppling till
 slutdestinationen.
</p>
</div>
</div>

<div id="outline-container-org38e4959" class="outline-3">
<h3 id="org38e4959">Data-länk</h3>
<div class="outline-text-3" id="text-org38e4959">
<p>
Länklagret difinierar nätverksmetoderna som beskriver hur hosten kommunicerar med in och
ugående routrar. Det används för att flytta packets mellan internetlagret hos två olika hosts.
TCP/IP använder sig av olika protokoll för att avgöra hur och vad som ska tas med och läggas
till från Nätverkslagret till Länklagret som exempelvis MAC-adresser.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
